app/views/ships/_pilots_display.html.erb

  <tbody>
      <% @ship.pilots.each do |pilot| %>
---
SELECT "pilots".* FROM "pilots" WHERE "pilots"."ship_id" IN (2)