app/controllers/ships_controller.rb

SELECT "ships".* FROM "ships"
---
  def index
    @ships = Ship.all

SELECT "pilots".* FROM "pilots" WHERE "pilots"."ship_id" IN (1)
SELECT "ships".* FROM "ships" WHERE "ships"."id" = 1 LIMIT 1
---
  def show
    @ship = Ship.includes(:pilots).find_by_id(params[:id])

INSERT INTO "ships" ("armament", "created_at", "crew", "has_astromech", "name", "speed", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ship = Ship.new(params[:ship])

    if @ship.save

SELECT "ships".* FROM "ships" WHERE "ships"."id" = 5 LIMIT 1
---
  def edit
    @ship = Ship.find_by_id(params[:id])

SELECT "ships".* FROM "ships" WHERE "ships"."id" = 5 LIMIT 1
UPDATE "ships" SET "name" = 'RZ-1 A-Wing', "updated_at" = '2012-12-07 22:38:20.585119' WHERE "ships"."id" = 1
---
  def update
    @ship = Ship.find_by_id(params[:id])

    if @ship.update_attributes(params[:ship])

SELECT "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT 1  [["id", "13"]]
DELETE FROM "ships" WHERE "ships"."id" = ?  [["id", 13]]
---
  def destroy
    @ship = Ship.find(params[:id])

    if @ship.destroy